#include <stdio.h>

//输入10个学生高考数学（分数为0到100的整数）成绩，利用统计各分数出现次数来对这10名学生高考数学成绩排序

int main(){
    int i,k=0,j=0;
    int a[10];/* 保存10名学生成绩 */
    int b[101];/* 数学成绩的取值有101种 */
    printf("请输入10个整数成绩：\n");
    for(i=0;i<10;i++)
        scanf("%d",&a[i]);
    for(i=0;i<101;i++)
        b[i]=0;/* 数学成绩取值情况初始化为0 */
    for(i=0;i<10;i++)
        b[a[i]]++;
    /* 更新排序结果到a[]中 */
    for(i=0;i<101;i++)
    {
        if(b[i]!=0)
        {
            for(k=0;k<b[i];k++)/* 将重复成绩按照统计出现的次数输出 */
            {
                a[j]=i;
                j++;
            }
        }
    }
    printf("排序结果：\n");
    for(i=0;i<10;i++)
        printf("%d ",a[i]);
    return 0;
}
